// /ПРИМИТИВНЫЙ


//number -1334546
//sting -"gwerty"
//boolean -true
//undefined -неопределенное значение
//null -нулевое значение
//bigInt
//symbol


//СЫЛОЧНЫЙ.СЛОЖНЫЙ

//Objeect -{}


//константа

//3.14
//2.72


// cons pi =3.14
// console.log(pi)
//
// var city = bishkek
//
//consol.log(city)

// +
//-
// /
// *
// %
// **

// let a = 10
// let b = 9
// let c = 2
// let d = 3
//
// console.log(Math.pow(a,b))
// console.log(d**c)
//
//
// let year = 2021
// year =3000
// year=5000


// console.log(Math.round(year/100))
// console.log(Match.floor(year/100))
// console.log(Math.ceil(year/100))
// console.log(Math.trunc(10.23243434343434))

//Math.floor()-21.9
//Math.round()
//math.ceil()-
//Math.random()  -0,1 -0.99991
//Math.pow()
//Math.abS
// console.log(Math.abs(-5))
//
// console.log(Math.flor( (Math.random()*10)+1))
// console.log(Math.)

//STINGS-строки

// let country=Kyrgyzstan
//
//
// console.log(country)
// console.log(country.length)
// console.log(country[country.length-1)/2-1] )
// let name='kurguzstan'
// // let str=
//
// let massage='Kurgyzstan'
// let str = 'Nevis ITDB TECH'
// console.log(str.slice(0.9))
// console.log(str[str.length -4])


//charat()
//  console.log( message.endsWith('k'))


//indexof()


// let num = 10
// console.log(num)

// let a = 10
// let b = 2
// let c = 5
//
// console.log(a+b+c)

// let l=100
// let m= 2
// console.log(l*m)

// let g=67
// let r=7
// console.log(g/r)

// let c = 15
// let d = 2
// let result = 17
// console.log(c + d)
// console.log(result)


// let a = 30
// let b = 15
// let c = a + b
// console.log(c)
// console.log(c % 4)

// let a = 17
// let b = 10
// let f = a-b
// let d = 10
// let  r = f +d
// console.log(r)


// let a ='10'
// let b = '99'
// let result = '109'
// console.log(result)

// let  name = 'Askar'
// let number = 10
// console.log(name + number)

// let str = 'Hello World!'
// console.log(str)

// let str = 'Hello '
// let str1 = 'World!'
// console.log(str,str1)


// ИНТЕРПОЛЯЦА
// ШАБЛОННЫЙ ЛИТЕРАЛ
//

// let username ='bill'
// let secondusername ='isaac'
// let string ='hello'+username
// let string1 ='my name is ${azem}
// // console.log(string)
// // console.log(string1)
// console.log(username[username.length -1])


// let days = 365
// let earth ='земля'
// let people ='7 млрд'
// let sun = 'солнце'
// let string = `В нашем году ${days} дней. Днём у нас светит ${sun}. Население планеты ${earth} составляет примерно ${people}. человек.`
// console.log(string)


// number


// *
// Number
// parseInt


// let n='20'
// console.log(+n)
// console.log(Number(n))
// console.log(parseInt(n))


//string

//toString
// String
//+''
// let num =10
// console.log(String(num))
// console.log( num.toString())
// console.log( 7 + '')

// typeof
//тип
// let flag=true
// let a = {}
//
// console.log(typeof num)
// console.log( typeof n)
// console.log( typeof flag)
// console.log(typeof a)
//
//

// // if()
// // else
// // ===
// // ==
// // =

// console.log('7'==='7')
//
// if (typeof flag ==='number'){
//     console.log('hello')
// }
// else {
//     console.log('good bye')
// }
// let  age =18
//
// if (age===16){
//     console.log('машинага уруксат')
// }else if (age ===18){
//     console.log('уйлон')
// }else if (age <=30){
//     console.log('тезирээк уйлон')
// }
//
//
// else {
//     console.log('бирааз чоной')
// }


// II - дизьюнкциа - логикалык кошуу
// && - коньюнкция - логикалык кобойтуу - жана
// true = 1
// false = 0

// console.log(true 11 false 11 false)
// console.log(true&& false&& true && false)

// let str = 'Hello World!'
// console.log(str)

////////HONE WORK ///////////////////////////////////

// let str = 'Hello '
// let str1 = 'World!'
// console.log(str,str1)
//
// let name =' Azem'
// let a = 'салам'
// console.log(name + a)

// let  age =18
//
// if (age===16){
//     console.log('машинага уруксат')
// }else if (age ===18)


//     let days = 365
//     let string = `В нашем году ${days} дней. `
// console.log(string)
//
// let a=50
// let s=1
// console.log(a/s)

// let  a = 10
// let b = 35
// console.log(a)

// let a = 50
// let b = 100
// if (a > b){
//     console.log('a болше b')
// }else {
//     console.log('a менше b')
// }

// let a =-2
//
// if (a > 0){
//     console.log('positive')
// }else if (a===0){
//     console.log('ravno')
// }else if (a < 0){
//     console.log('negative')
// }


// let number = 20
// let second = 30
//
//
// if (number > 30 && second > 20){
//     console.log(true)
// } else {
//     console.log(false)
// }

// let age = 18
//
// if (age >= 16 && age > 30) {
//     console.log('машинага уруксат')
// } else if (age === 18) {
//     console.log(армияга
//     бар
// )
// } else if (age > 18 && age < 30) {
//     console.log(уйлон)
// } else if (age === 30) {
//     console.log('уйлон')
// } else if (age === 30) {
//     console.log('тезирээк уйлон')
// } else if (age > 30 && age < 40) {
//     console.log('мылтык атканы уруксат')
// } else if (age > 50) {
//     console.log('пенсия')
// } else {
//     console.log('бирааз чоной')
// }

// let month = 10
//
// if (month >= 6 && month <= 8){
//     console.log( 'жай')
// }
// else if  ( month === 12 || (month > 0 && month <= 2)){
//     console.log('кыш')
// }else if (month>=3 && month < 6){
//     console.log('жаз')
// }else if (month >= 6 && month < 9){
//     console.log('жаз')
// }else if (month > 9&& month < 12){
//     console.log("куз")
// }else{
//     console.log('мындай айлар жок')
// }
// 6. Вам дана переменная s. Составьте условие, по которому в консоль будет выводится тип этой переменной - "boolean", "number", "string".
// typeof
//     let n = {}
// console.log(false + 4)
//
// let  s = true + true+ 'true'
// // 1+1+true
// // 2true
// if (typeof  s ==='boolean'){
//     console.log('boolean')
// }else if (typeof s=== 'number'){
//     console.log('number')
// }else{
//     console.log('string')
// }


//  [25.10.21 14:27]
// 4. Вам дана переменная number=45. Составьте условие, по которому будет выводиться в консоль "Четное число", "Нечетное число".
// 5. Вам даны две переменные a=10, b=2. Составьте условие, по которому, остаток деления a на b, будет выводиться консоль "Четное число", "Нечетное число".
//
// 7. Вам дана переменная а. Если переменная a больше одного и меньше 9-ти, то выведите 'Верно', иначе выведите 'Неверно'.

// let  a = s
// if (a> 1 && a < 9){
//     console.log('verno')
// }else {
//     console.log('neverno')
// }

// 8. Вам дана переменная а. Если переменная a равна трем или равна семи, то прибавьте к ней 7, иначе поделите ее на 10. Выведите новое значение переменной в консоль.
// let a = 9
//
// if (a===3 || a === 7){
//     console.log(a + 7)
// }else{
//     console.log(a / 10)
// }
// 9. Вам даны переменные а , b. Если переменная a равна или меньше 0, а переменная b больше или равна 5, то выведите сумму этих переменных, иначе выведите их разность (результат вычитания).
// let  a = 9
// let b = 5
// if ((a> 4 && a < 10) || (b > 7 || b < 17)){
//     console.log('oba')
// }else {
//     console.log('jok')
// }
// console.log('12' && '000'&& 'javascript' && 0)
//
// console.log(0 || 'java' || 'javascript' || 0)

// 10. Вам даны переменные a , b. Если переменная a больше 4-х и меньше 10-ти, или переменная b больше или равна 7-ми и меньше 17-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.

// 11. Вам дана переменная month. В ней лежит какое-то число из интервала от 1 до 12. Определите в какую пору года попадает этот месяц (зима, лето, весна, осень).
// 12. Вам дана переменная day. В ней лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).
// let day = 5
//
// if (day > 0 && day < 11){
//     console.log(1)
// }else if (day > 11 && day < 21){
//     console.log(2)
// }else if (day > 20 && day <=31){
//     console.log(3)
// }
// 13. Вам дана переменная a='12345'. Проверьте, что первым символом этой переменной является цифра 1, 2 или 3. Если это так – выведите ‘да’, в противном случае выведите ‘нет’.
//
// let  a ='12345'
// console.log(a[0])
// if (+a[0] === 1 || +a[0]=== 2 || +a[0] ===3){
//     console.log('oba')
// }else {
//     console.log('lok')
// }
// let a = 10
// let b = 2
// if (a/b){
//     console.log('Четное число')
// }else {
//     console.log("Нечетное число")
// }

// let number = 45
//
// if (number % 2 === 0){
//     console.log('жуп сан')
// }else {
//     console.log('так сан')
// }

// let a=10
// let b=2
//
// if ((a/b)% 2 === 0){
//     console.log('жуп сан')
// }else {
//     console.log('так сан')
// }

// function showMessage() {
//     alert( 'Всем привет!' );
// }

// ыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыы

// let str ='Максимально УЖАСНО'
// console.log(str.substr(0,11).toUpperCase())


// let str ='Максимально УЖАСНО'
// let f = 'МАКСИМАЛЬНО'
// console.log()
// 4 Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль каждый символ этой строки, используя метод split. Пример : [ 'C','o','d','i','n','g',' ','i','s',' ','t','h','e',' ', 'L','O','V','E',' ','o','f',' ','m','y',' ','L','I','F','E','!' ]
// let b = 'МАКСИМАЛЬНО УЖАСНО'
// console.log(b.split(''))

// const str2 =  'Максимально Ужасно, переделывай'
// const re = str2.split(" ", 3)
// console.log(re)

//
// let text = 'Максимально Ужасно';
// let letter = text.charAt(text.length-6)
// console.log(letter)

// const str = 'Максимально Ужасно'
// const str1 = 'мально Ужасно'
// const children = str.concat(str1);
// console.log(children)

// 9. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль индекс слова 'Ужасно'.
// 10. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль "встречается более 1 раза", если букв 'a' встречается более 1 раза, иначе "встречается менее одного раза"

// let str = 'Максимально Ужасно'
//
// console.log(str.indexOf('М'))
//
// if (str.indexOf('а') > -1){
//     console.log('кездешти')
// }else {
//     console.log('кездещкен жок')
// }

// 11. Вам дана переменная str = 'макСИМАЛЬНО ужаСНО'. Выведите в консоль первую букву каждого слова строки в верхний регистр.
// let c = 'макСИМАЛЬНО ужаСНО'
// let a = c[0]
// let b = c[12]
// let s = c[19]
// console.log(a.toUpperCase()+c.slice(1,12).toLowerCase()+b.toUpperCase()+c.slice(13,19).toLowerCase())

// let name ='azem'
// let surname = 'aliev'
// console.log(name.toUpperCase()+surname.slice(1,5).toLowerCase()+)
// 12. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль индекс первого вхождения буквы а.

// 13. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль индекс первого последнего буквы о.
// 14. Вам дана переменная str = 'aaa bbb ccc'. Вырежите из нее слово 'bbb' тремя разными способами (через substr, substring, slice) и выведите в консоль.
// let str = 'aaa bbb ccc'
// console.log(str.substring(4,7))
// console.log(str.substr(4,4))
// console.log(str.slice(4,7))
// 15. Вам дана переменная str = '17-02-2021'. Преобразуйте эту дату в формат '31/12/2025' и выведите в консоль.
// let str = '17-02-2021'
//
// console.log(str.replace(/-/g,'/'))

// 16. Вам дана переменная str = 'Максимально Ужасно'. Проверьте, есть ли буква "в" в данной строке, если да, то выведите "Да", иначе - "нет".
// let str = 'Максимально Ужасно'
// if (a.includes('k')){
//     console.log('da')
// }else {
//     console.log('net')
// }
// 17. Вам дана переменная str = 'АаааааА'. Проверьте, если первая буква в строке совпадает с последней, если да, то выведите в консоль "Совпадает", иначе - "Не совпадает".
// let str = 'АаааааА'
// if (str[0]===str [str.length-1]){
//     console.log(true)
// }else {
//     console.log(false)
// }
// 18. Вам дана переменная str = 'Максимально'. Проверьте, если буква л, встречается в первой половине строки, или последней. Если в первой, то выведите в консоль - "В первой половине", иначе - "Во второй половине".
// let str = 'Максимально'
// let s = 'n'
// if (str.indexOf(s)=== Math.floor(str.length/2)){
//     console.log(1)
// }else {
//     console.log(2)
// }



////////////////////////ФУНКЦИЯ/////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// FUNCTION DECLARATION -ОБЯВЛЕНИЕ ФУНКЦИИ

// FUNCTION EXPRESSION - ВЫРАЖЕНИЕ  ФУНКЦИИ

// ARROW FUNCTION - СТРЕЛОЧНАЯ  ФУНКЦИИ

// IIFE  - IMMEDIATE INVOKED FUNCTION EXPRESSION -САМОВЫЗЫВАЮЩАЙСЯ  ФУНКЦИИ


//////////////////////FUNCTION DECLARATION\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

// function sum (a,b){
//     return a+b
// }
//
// console.log(sum(10,20))
// function dev (a,b){
//     return a*b
// }
//
// console.log(dev(10,20))
// function kol (a,b){
//     return a/b
// }
//
// console.log(kol(300,20))
// function jok(a,b){
//     return a%b
// }
//
// console.log(kol(5,50))
// function dre(a,b){
//     return a-b
// }
//
// console.log(dre(50,5))
// function gtr(a,b){
//     return a**b
// }
//
// console.log(gtr(50,5))

//multiply  *
//divide()  /
//rem()    %
//sub()   -
//pow ()  **


// 😎, [30.10.21 14:09]
// 1. Вам дана переменная str = 'Nevis ITDB TECH'. Выведите в консоль длину первого слова.
// let str = 'Nevis ITDB TECH'
// function len(str){
//     return str.length
// }
//
// console.log(len(str))
// 2. Вам дана переменная str = 'Максимально УЖАСНО'. Выведите в консоль слово УЖАСНО, только нижним регистром.
// console.log(len(str)).
// 3. Вам дана переменная str = 'максимально УЖАСНО'. Выведите в консоль слово максимально, только верхним регистром.
// let  string =  'максимально УЖАСНО'
// console.log(string.substr(0,11).toUpperCase()
// console.log(string.slice(0,11).toUpperCase())
// console.log(string.substring(0,11).toUpperCase())
// 4. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль каждый символ этой строки, используя метод split. Пример : [ 'C','o','d','i','n','g',' ','i','s',' ','t','h','e',' ', 'L','O','V','E',' ','o','f',' ','m','y',' ','L','I','F','E','!' ]
// let str = 'Максимально УЖАСНО'
// function task(string){
//     return string.split('')
// }
// console.log(task(str))
// 5. Вам дана переменная str = 'Максимально Ужасно, переделывай'. Выведите в консоль все слова этой строки, используя метод split. Пример: [ 'Максимально' 'ужасно', 'переделывай'. ]
// function task5(code){
//     return code.split(' ')
// }
// console.log(task5( 'Максимально Ужасно, переделывай' ))
// 6. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль 'мально Ужасно', используя метод slice.
// function  task6( str){
//     return str.slice(5)
// }
// console.log(task6('Максимально Ужасно'))
// 7. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль букву У, использую метод charAt.
// function task7(srt){
//     return srt. charAt(12)
// }
//
// console.log(task7('Максимально Ужасно'))
// 8. Вам даны переменные str = 'Максимально', str2 = 'Ужасно'. Выведите в консоль соединенные строки, используя метод concat.
// function task8(str,str2){
//  // 1  // return str + str2
//     return str.concat(str2)
// }
//
// console.log('Максимально','Ужасно')
// 9. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль индекс слова 'Ужасно'.
// function task9(str){
//     return str.slice(12)
// }
//
// console.log(task9('Максимально Ужасно'))
// 10. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль "встречается более 1 раза", если букв 'a' встречается более 1 раза, иначе "встречается менее одного раза"
// function task10(str){
//  if (str.includes('а')){
//      return true
//  }else {
//      return false
//  }
// }
//
// console.log(task10('Максимально Ужасно'))
// 11. Вам дана переменная str = 'макСИМАЛЬНО ужаСНО'. Выведите в консоль первую букву каждого слова строки в верхний регистр.
// let str1 = 'макСИМАЛЬНО ужаСНО'
// let a = str1[0]
// let str2 = 'макСИМАЛЬНО ужаСНО'
// let b = str2 [12]
// function lik (str1,str2){
//     return (a.toUpperCase() + str1.slice(1,12).toLowerCase() + (b.toUpperCase() + str2.slice(13,19).toLowerCase()))
//     console.log(lik(str1, str2))
// 12. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль индекс первого вхождения буквы а.
// let l = 'Максимально Ужасно'
// function task12(str){
//     return str.indexOf('а')
// }
// console.log(task12(l))
// 13. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль индекс первого последнего буквы о.
// function task13(str){
//     return str.lastIndexOf('о')
// }
// console.log(task13( 'Максимально Ужасно'))
// 14. Вам дана переменная str = 'aaa bbb ccc'. Вырежите из нее слово 'bbb' тремя разными способами (через substr, substring, slice) и выведите в консоль.
// function task14(str){
//     // return str.substr(3,5)
//     // return str.substring(3,7)
//     return str.slice(3,7)
// }
//
// console.log(task14('aaa bbb ccc'))

// 15. Вам дана переменная str = '17-02-2021'. Преобразуйте эту дату в формат '31/12/2025' и выведите в консоль.
// function task15(str){
//     return str.replace(/-/g,'/')
// }
//
// console.log(task15( '17-02-2021'))
// 16. Вам дана переменная str = 'Максимально Ужасно'. Проверьте, есть ли буква "в" в данной строке, если да, то выведите "Да", иначе - "нет".
// function task16(str){
//     if (str.includes('в')){
//         return true
//     }else {
//         return false
//     }
// }
// console.log(task16('Максимально Ужасно'))
// 17. Вам дана переменная str = 'АаааааА'. Проверьте, если первая буква в строке совпадает с последней, если да, то выведите в консоль "Совпадает", иначе - "Не совпадает".
// function task17(str){
//     if (str[0]=== str[str.length-1]){
//         return true
//     }
//     return false
// }
//
// console.log(task17('АаааааА'))

// 18. Вам дана переменная str = 'Максимально'. Проверьте, если буква л, встречается в первой половине строки, или последней. Если в первой, то выведите в консоль - "В первой половине", иначе - "Во второй половине".
// function task18(str){
//     let symbol = str.indexOf('л')
// if (symbol === Math.floor(str.length/2)){
//     console.log(1)
// }
//     console.log(2)
// }
//
// console.log(task18('Максимально'))
// функция => =>'7'

//     function f(num){
//     return String(num)
// }
//
// console.log(f(7))

//       function converter(number){
//
//      if (number >0){
//     return number * -1
// }else if (number < 0){
//          return number * -1
//      }
// }
// console.log(converter(10))
//   function converter(number){
// //
//      if (typeof >number ){
//     return number * -1
// }else if (number < 0){
//          return number * -1
//      }
// }
// console.log(converter(10))


// function century(year) {
//     // Finish this :)
//     return Math.ceil(year/100);
// }
//
// console.log(century(2100))

// function lovefunc(flower1, flower2){
//     // moment of truth
//     if ((flower1+flower2)%2 ===0){
//        return false
//     }else  {
//         return true
//     }
// }
//
// console.log(lovefunc( 3,2))
//  function usd(usd){
//     return `${(usd * 6.75).toFixed(2)}Chinese Yuan`
//  }
//
// console.log(usd( 100))
////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////ARROW FUNCTION\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
// const myFunction = (a,b) =>{
//     return a+b
// }
// console.log(myFunction(10,10))

// const greet = (name) => {
// return "Hello,$[name]how are you doing today?"
// }
// console.log(greet('azem'))
// const rentalCarCost =(d) =>{
//     if (d >= && d < 7){
//         return (1 * 40)-20
//     }else if ()
// }

// 1. Вам дана переменная str = 'Nevis ITDB TECH'. Выведите в консоль длину первого слова.
// let str =  'Nevis ITDB TECH'
// const text = (str) => {
//     return  str.length
//
// }
// console.log(text(str))
// 2. Вам дана переменная str = 'Максимально УЖАСНО'. Выведите в консоль слово УЖАСНО, только нижним регистром.

// 3. Вам дана переменная str = 'максимально УЖАСНО'. Выведите в консоль слово максимально, только верхним регистром.
// 4. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль каждый символ этой строки, используя метод split. Пример : [ 'C','o','d','i','n','g',' ','i','s',' ','t','h','e',' ', 'L','O','V','E',' ','o','f',' ','m','y',' ','L','I','F','E','!' ]
// let str = 'Максимально УЖАСНО'
// const task = (string)=>{
//     return string.split('')
// }
// console.log(task(str))
// 5. Вам дана переменная str = 'Максимально Ужасно, переделывай'. Выведите в консоль все слова этой строки, используя метод split. Пример: [ 'Максимально' 'ужасно', 'переделывай'. ]
// const task5 = (code)=>{
//     return code.split(' ')
// }
// console.log(task5( 'Максимально Ужасно, переделывай' ))
// 6. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль 'мально Ужасно', используя метод slice.
// const  task6 = ( str) =>{
//     return str.slice(5)
// }
// console.log(task6('Максимально Ужасно'))

// 7. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль букву У, использую метод charAt.
// const task7 = (str) =>{
//     return str.charAt(12)
// }
// console.log(task7('Максимально Ужасно'))
// 8. Вам даны переменные str = 'Максимально', str2 = 'Ужасно'. Выведите в консоль соединенные строки, используя метод concat.
// const task8 = (str,str2) =>{
//  // 1  // return str + str2
//     return str.concat(str2)
// }
//
// console.log('Максимально','Ужасно')
// 9. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль индекс слова 'Ужасно'.
// const task9=(str)=>{
//     return str.slice(12)
// }
//
// console.log(task9('Максимально Ужасно'))
// 10. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль "встречается более 1 раза", если букв 'a' встречается более 1 раза, иначе "встречается менее одного раза"
// const task10 = (str)=>{
// if (str.includes('а')){
//      return true
//  }else {
//      return false
//  }
// }
//
// console.log(task10('Максимально Ужасно'))
// 11. Вам дана переменная str = 'макСИМАЛЬНО ужаСНО'. Выведите в консоль первую букву каждого слова строки в верхний регистр.
// let str1 = 'макСИМАЛЬНО ужаСНО'
// let a = str1[0]
// let str2 = 'макСИМАЛЬНО ужаСНО'
// let b = str2 [12]
// const lik  =(str1,str2)=> {
//     return (a.toUpperCase() + str1.slice(1,12).toLowerCase() + (b.toUpperCase() + str2.slice(13,19).toLowerCase()))
//     console.log(lik(str1, str2))
// 12. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль индекс первого вхождения буквы а.

// const task12 = (str) =>{
//     return str.indexOf('а')
// }
// console.log(task12('Максимально Ужасно'))
// 13. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль индекс первого последнего буквы о.
// const  task13 = (str)=>{
//     return str.lastIndexOf('о')
// }
// console.log(task13( 'Максимально Ужасно'))
// 14. Вам дана переменная str = 'aaa bbb ccc'. Вырежите из нее слово 'bbb' тремя разными способами (через substr, substring, slice) и выведите в консоль.
// const task14 = (str) => {
//     //     // return str.substr(3,5)
//     //     // return str.substring(3,7)
//     return str.slice(3,7)
// }
//
// console.log(task14('aaa bbb ccc'))

// 15. Вам дана переменная str = '17-02-2021'. Преобразуйте эту дату в формат '31/12/2025' и выведите в консоль.
// const task15 = (str) =>{
//     return str.replace(/-/g,'/')
// }
//
// console.log(task15( '17-02-2021'))
// 16. Вам дана переменная str = 'Максимально Ужасно'. Проверьте, есть ли буква "в" в данной строке, если да, то выведите "Да", иначе - "нет".
// const task16 = (str) => {
//     if (str.includes('в')){
//         return true
//     }else {
//         return false
//     }
// }
// console.log(task16('Максимально Ужасно'))
//17. Вам дана переменная str = 'АаааааА'. Проверьте, если первая буква в строке совпадает с последней, если да, то выведите в консоль "Совпадает", иначе - "Не совпадает".
// const task17= (str) => {
//     if (str[0]=== str[str.length-1]){
//         return true
//     }
//     return false
// }
//
// console.log(task17('АаааааА'))
//
// // 18. Вам дана переменная str = 'Максимально'. Проверьте, если буква л, встречается в первой половине строки, или последней. Если в первой, то выведите в консоль - "В первой половине", иначе - "Во второй половине".
// const task18 = (str) => {
//     let symbol = str.indexOf('л')
// if (symbol === Math.floor(str.length/2)){
//     console.log(1)
// }
//     console.log(2)
// }
// console.log(task18('Максимально'))


// var start = 100;
// var result = [];
// for(start;start>=0;start--){
//     result.push(start--);
}
